In [ ]:
#Trivikram Ranga

In [1]:
import pandas as pd

In [2]:
lower = pd.read_csv('50kTO90K.csv')
higher = pd.read_csv('90kTO200K.csv')

In [3]:
lower.head(5)

   Unnamed: 0 Geographic Area Name  Population
0          56           Fall River       89388
1         212               Newton       88593
2         218           Somerville       80906
3          89             Lawrence       79942
4         197           Framingham       72308

In [4]:
normalized_df = pd.read_csv('household_normalization.csv')
print(normalized_df.columns)

Index(['Unnamed: 0', 'Muni', 'Eviction Numbers', 'Total Households',
       'Renter Occupied Pct', 'Renter Occupied',
       'Evictions per Rented Households'],
      dtype='object')

In [5]:
print(normalized_df.head(1))

   Unnamed: 0       Muni  Eviction Numbers  Total Households  \
0           0  Worcester              3743             71595

   Renter Occupied Pct  Renter Occupied  Evictions per Rented Households
0                 58.7            42026                         0.089064

In [6]:
higher.head(5)

   Unnamed: 0 Geographic Area Name  Population
0         356            Worcester      185143
1         154          Springfield      154139
2         190            Cambridge      116632
3         205               Lowell      111306
4         267             Brockton       95594

In [7]:
compare_lower = normalized_df[normalized_df.Muni.isin(lower['Geographic Area Name'])][['Muni','Eviction Numbers','Renter Occupied','Evictions per Rented Households']]
compare_higher = normalized_df[normalized_df.Muni.isin(higher['Geographic Area Name'])][['Muni','Eviction Numbers','Renter Occupied','Evictions per Rented Households']]

In [8]:
compare_lower.head(5).sort_values(by='Evictions per Rented Households',ascending=False)

,Muni,Eviction Numbers,Renter Occupied,Evictions per Rented Households
2,Fall River,2355,24496,0.096138
9,Framingham,1154,13010,0.088701
13,Haverhill,757,10405,0.072753
14,Revere,691,9630,0.071755
8,Lawrence,1194,17911,0.066663

In [9]:
compare_higher.head(5).sort_values(by='Evictions per Rented Households',ascending=False)

,Muni,Eviction Numbers,Renter Occupied,Evictions per Rented Households
5,Brockton,1507,14317,0.105259
1,Springfield,2983,30095,0.099119
3,New Bedford,2282,23255,0.098129
0,Worcester,3743,42026,0.089064
4,Lowell,1741,22745,0.076544